//ALLOCFDA JOB 1,NOTIFY=&SYSUID
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=CNVTSYS
    DELETE &SYSUID..DATA
    SET MAXCC=0
//DATA    EXEC PGM=IEFBR14
//SYSPRINT DD DUMMY
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//DD1      DD DSN=&SYSUID..DATA,DISP=(,CATLG,DELETE),
//            LIKE=ZOS.PUBLIC.SEQ.DATA
