//PRTVSAM   JOB 1,NOTIFY=&SYSUID
//S1   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
    LISTCAT ENTRIES( &SYSUID..VSAM )
    IF LASTCC = 0 THEN -
    PRINT INDATASET( &SYSUID..VSAM )
/*
